12/data/attachments/58a237e608b7c9e3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Nicholas_game_Friend_53480_5</nif:username>
            <nif:friendToBeRequested>soap_friends_bc07b27b-98ea-4754-abc5-99e04a57ce90</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>